'''
Задание 3

3.1Проанализировать работу скрипта, представленного на
рисунке 4.6 с закомментированной строкой
и раскомментированной строкой 48.

3.2 Проверить, можно ли включить вызов
конструктора базового класса из метода
экземпляра класса-наследника.

3.3 Определить, как решается вопрос о
работе конструкторов в скрипте,
представленном на рисунке 4.3.
'''


class Class1:
    def __init__(self):
        print("Class1, __init__")

    def fun1(self):
        print("Class1, fun1")


class Class2(Class1):
    def __init__(self):
        print("Class2, __init__")
        Class1.__init__(self)

    def fun1(self):
        print("Class2, fun1")


obj1 = Class1()
obj1.fun1()

obj2 = Class2()
obj2.fun1()
